
//--------------------РАБОТА С МАССИВОМ---------------------------------------------------------
/* let arrQustions = ['сколько вам лет?', 'откуда вы?', 'какое кино любите?']; // литерал массива - значение написанное непосредтвенно в тексте программы.
let userAnswer = []; // массив для хранения ответов пользователя.
let counter = 0; // счетчик - внешняя переменная, значение которой будет меняться динамически в цикле.

while (counter < arrQustions.length) { // условие, пока значение в переменной counter меньше длинны масива(количества значений массива), условие возвращает true, код выполняется.
    let answer = prompt(`${arrQustions[counter]}`); // получаем значение массива с вопросами последовательно, значение counter выступает за индекс массива.
    userAnswer.push(answer); // пушим в массив с ответами, значение переменной answer, в которую присваивается результат работы функции prompt(), 
                            //которая возвращает ответ, который ввел пользователь в модальном окне.
    counter++; // увеличиваем значение в переменной на единицу каждую итерацию. для счеткичка и для индекса массива.
}
console.log(userAnswer); */

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------